; domain
(define (domain warehouse)
  (:requirements :strips :typing)

  (:types
    robot package location - object
  )

  (:predicates
    (at-robot ?r - robot ?l - location)
    (at-package ?p - package ?l - location)
    (in-robot ?p - package ?r - robot)
    (robot-free ?r - robot)
    (connected ?l1 - location ?l2 - location)
  )

  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and
      (at-robot ?r ?from)
      (connected ?from ?to)
    )
    :effect (and
      (not (at-robot ?r ?from))
      (at-robot ?r ?to)
    )
  )

  (:action pickup
    :parameters (?r - robot ?p - package ?l - location)
    :precondition (and
      (at-robot ?r ?l)
      (at-package ?p ?l)
      (robot-free ?r)
    )
    :effect (and
      (not (at-package ?p ?l))
      (in-robot ?p ?r)
      (not (robot-free ?r))
    )
  )

  (:action drop
    :parameters (?r - robot ?p - package ?l - location)
    :precondition (and
      (at-robot ?r ?l)
      (in-robot ?p ?r)
    )
    :effect (and
      (not (in-robot ?p ?r))
      (at-package ?p ?l)
      (robot-free ?r)
    )
  )
)

; problem
(define (problem warehouse-delivery)
 (:domain warehouse)

 (:objects
  r2 - robot
  p2 - package
  zone_0_0 zone_0_1 zone_0_2 zone_0_3 zone_0_4 zone_0_5 zone_0_6 zone_1_0 zone_1_1 zone_1_2 zone_1_3 zone_1_4 zone_1_5 zone_1_6 zone_2_0 zone_2_1 zone_2_2 zone_2_3 zone_2_4 zone_2_5 zone_2_6 zone_3_0 zone_3_1 zone_3_2 zone_3_5 zone_3_6 zone_4_0 zone_4_1 zone_4_2 zone_4_3 zone_4_4 zone_4_5 zone_4_6 zone_5_0 zone_5_1 zone_5_2 zone_5_3 zone_5_4 zone_5_5 zone_5_6 zone_6_0 zone_6_1 zone_6_2 zone_6_3 zone_6_4 zone_6_5 zone_6_6 - location
 )

 (:init
  (at-robot r2 zone_0_2)
  (robot-free r2)
  (at-package p2 zone_4_5)
  (connected zone_0_0 zone_0_1)
  (connected zone_0_0 zone_1_0)
  (connected zone_0_1 zone_0_2)
  (connected zone_0_1 zone_0_0)
  (connected zone_0_1 zone_1_1)
  (connected zone_0_2 zone_0_3)
  (connected zone_0_2 zone_0_1)
  (connected zone_0_2 zone_1_2)
  (connected zone_0_3 zone_0_4)
  (connected zone_0_3 zone_0_2)
  (connected zone_0_3 zone_1_3)
  (connected zone_0_4 zone_0_5)
  (connected zone_0_4 zone_0_3)
  (connected zone_0_4 zone_1_4)
  (connected zone_0_5 zone_0_6)
  (connected zone_0_5 zone_0_4)
  (connected zone_0_5 zone_1_5)
  (connected zone_0_6 zone_0_5)
  (connected zone_0_6 zone_1_6)
  (connected zone_1_0 zone_1_1)
  (connected zone_1_0 zone_2_0)
  (connected zone_1_0 zone_0_0)
  (connected zone_1_1 zone_1_2)
  (connected zone_1_1 zone_1_0)
  (connected zone_1_1 zone_2_1)
  (connected zone_1_1 zone_0_1)
  (connected zone_1_2 zone_1_3)
  (connected zone_1_2 zone_1_1)
  (connected zone_1_2 zone_2_2)
  (connected zone_1_2 zone_0_2)
  (connected zone_1_3 zone_1_4)
  (connected zone_1_3 zone_1_2)
  (connected zone_1_3 zone_2_3)
  (connected zone_1_3 zone_0_3)
  (connected zone_1_4 zone_1_5)
  (connected zone_1_4 zone_1_3)
  (connected zone_1_4 zone_2_4)
  (connected zone_1_4 zone_0_4)
  (connected zone_1_5 zone_1_6)
  (connected zone_1_5 zone_1_4)
  (connected zone_1_5 zone_2_5)
  (connected zone_1_5 zone_0_5)
  (connected zone_1_6 zone_1_5)
  (connected zone_1_6 zone_2_6)
  (connected zone_1_6 zone_0_6)
  (connected zone_2_0 zone_2_1)
  (connected zone_2_0 zone_3_0)
  (connected zone_2_0 zone_1_0)
  (connected zone_2_1 zone_2_2)
  (connected zone_2_1 zone_2_0)
  (connected zone_2_1 zone_3_1)
  (connected zone_2_1 zone_1_1)
  (connected zone_2_2 zone_2_3)
  (connected zone_2_2 zone_2_1)
  (connected zone_2_2 zone_3_2)
  (connected zone_2_2 zone_1_2)
  (connected zone_2_3 zone_2_4)
  (connected zone_2_3 zone_2_2)
  (connected zone_2_3 zone_1_3)
  (connected zone_2_4 zone_2_5)
  (connected zone_2_4 zone_2_3)
  (connected zone_2_4 zone_1_4)
  (connected zone_2_5 zone_2_6)
  (connected zone_2_5 zone_2_4)
  (connected zone_2_5 zone_3_5)
  (connected zone_2_5 zone_1_5)
  (connected zone_2_6 zone_2_5)
  (connected zone_2_6 zone_3_6)
  (connected zone_2_6 zone_1_6)
  (connected zone_3_0 zone_3_1)
  (connected zone_3_0 zone_4_0)
  (connected zone_3_0 zone_2_0)
  (connected zone_3_1 zone_3_2)
  (connected zone_3_1 zone_3_0)
  (connected zone_3_1 zone_4_1)
  (connected zone_3_1 zone_2_1)
  (connected zone_3_2 zone_3_1)
  (connected zone_3_2 zone_4_2)
  (connected zone_3_2 zone_2_2)
  (connected zone_3_5 zone_3_6)
  (connected zone_3_5 zone_4_5)
  (connected zone_3_5 zone_2_5)
  (connected zone_3_6 zone_3_5)
  (connected zone_3_6 zone_4_6)
  (connected zone_3_6 zone_2_6)
  (connected zone_4_0 zone_4_1)
  (connected zone_4_0 zone_5_0)
  (connected zone_4_0 zone_3_0)
  (connected zone_4_1 zone_4_2)
  (connected zone_4_1 zone_4_0)
  (connected zone_4_1 zone_5_1)
  (connected zone_4_1 zone_3_1)
  (connected zone_4_2 zone_4_3)
  (connected zone_4_2 zone_4_1)
  (connected zone_4_2 zone_5_2)
  (connected zone_4_2 zone_3_2)
  (connected zone_4_3 zone_4_4)
  (connected zone_4_3 zone_4_2)
  (connected zone_4_3 zone_5_3)
  (connected zone_4_4 zone_4_5)
  (connected zone_4_4 zone_4_3)
  (connected zone_4_4 zone_5_4)
  (connected zone_4_5 zone_4_6)
  (connected zone_4_5 zone_4_4)
  (connected zone_4_5 zone_5_5)
  (connected zone_4_5 zone_3_5)
  (connected zone_4_6 zone_4_5)
  (connected zone_4_6 zone_5_6)
  (connected zone_4_6 zone_3_6)
  (connected zone_5_0 zone_5_1)
  (connected zone_5_0 zone_6_0)
  (connected zone_5_0 zone_4_0)
  (connected zone_5_1 zone_5_2)
  (connected zone_5_1 zone_5_0)
  (connected zone_5_1 zone_6_1)
  (connected zone_5_1 zone_4_1)
  (connected zone_5_2 zone_5_3)
  (connected zone_5_2 zone_5_1)
  (connected zone_5_2 zone_6_2)
  (connected zone_5_2 zone_4_2)
  (connected zone_5_3 zone_5_4)
  (connected zone_5_3 zone_5_2)
  (connected zone_5_3 zone_6_3)
  (connected zone_5_3 zone_4_3)
  (connected zone_5_4 zone_5_5)
  (connected zone_5_4 zone_5_3)
  (connected zone_5_4 zone_6_4)
  (connected zone_5_4 zone_4_4)
  (connected zone_5_5 zone_5_6)
  (connected zone_5_5 zone_5_4)
  (connected zone_5_5 zone_6_5)
  (connected zone_5_5 zone_4_5)
  (connected zone_5_6 zone_5_5)
  (connected zone_5_6 zone_6_6)
  (connected zone_5_6 zone_4_6)
  (connected zone_6_0 zone_6_1)
  (connected zone_6_0 zone_5_0)
  (connected zone_6_1 zone_6_2)
  (connected zone_6_1 zone_6_0)
  (connected zone_6_1 zone_5_1)
  (connected zone_6_2 zone_6_3)
  (connected zone_6_2 zone_6_1)
  (connected zone_6_2 zone_5_2)
  (connected zone_6_3 zone_6_4)
  (connected zone_6_3 zone_6_2)
  (connected zone_6_3 zone_5_3)
  (connected zone_6_4 zone_6_5)
  (connected zone_6_4 zone_6_3)
  (connected zone_6_4 zone_5_4)
  (connected zone_6_5 zone_6_6)
  (connected zone_6_5 zone_6_4)
  (connected zone_6_5 zone_5_5)
  (connected zone_6_6 zone_6_5)
  (connected zone_6_6 zone_5_6)
 )

 (:goal (and
  (at-package p2 zone_0_0)
 ))
)

; plan
1. (move r2 zone_0_2 zone_1_2)
   deleted: (at-robot r2 zone_0_2)
   added: (at-robot r2 zone_1_2)
   goals met: 0 of 1
2. (move r2 zone_1_2 zone_2_2)
   deleted: (at-robot r2 zone_1_2)
   added: (at-robot r2 zone_2_2)
   goals met: 0 of 1
3. (move r2 zone_2_2 zone_3_2)
   deleted: (at-robot r2 zone_2_2)
   added: (at-robot r2 zone_3_2)
   goals met: 0 of 1
4. (move r2 zone_3_2 zone_4_2)
   deleted: (at-robot r2 zone_3_2)
   added: (at-robot r2 zone_4_2)
   goals met: 0 of 1
5. (move r2 zone_4_2 zone_4_3)
   deleted: (at-robot r2 zone_4_2)
   added: (at-robot r2 zone_4_3)
   goals met: 0 of 1
6. (move r2 zone_4_3 zone_4_4)
   deleted: (at-robot r2 zone_4_3)
   added: (at-robot r2 zone_4_4)
   goals met: 0 of 1
7. (move r2 zone_4_4 zone_4_5)
   deleted: (at-robot r2 zone_4_4)
   added: (at-robot r2 zone_4_5)
   goals met: 0 of 1
8. (pickup r2 p2 zone_4_5)
   deleted: (at-package p2 zone_4_5) (robot-free r2)
   added: (in-robot p2 r2)
   goals met: 0 of 1
9. (move r2 zone_4_5 zone_3_5)
   deleted: (at-robot r2 zone_4_5)
   added: (at-robot r2 zone_3_5)
   goals met: 0 of 1
10. (move r2 zone_3_5 zone_2_5)
   deleted: (at-robot r2 zone_3_5)
   added: (at-robot r2 zone_2_5)
   goals met: 0 of 1
11. (move r2 zone_2_5 zone_1_5)
   deleted: (at-robot r2 zone_2_5)
   added: (at-robot r2 zone_1_5)
   goals met: 0 of 1
12. (move r2 zone_1_5 zone_0_5)
   deleted: (at-robot r2 zone_1_5)
   added: (at-robot r2 zone_0_5)
   goals met: 0 of 1
13. (move r2 zone_0_5 zone_0_4)
   deleted: (at-robot r2 zone_0_5)
   added: (at-robot r2 zone_0_4)
   goals met: 0 of 1
14. (move r2 zone_0_4 zone_0_3)
   deleted: (at-robot r2 zone_0_4)
   added: (at-robot r2 zone_0_3)
   goals met: 0 of 1
15. (move r2 zone_0_3 zone_0_2)
   deleted: (at-robot r2 zone_0_3)
   added: (at-robot r2 zone_0_2)
   goals met: 0 of 1
16. (move r2 zone_0_2 zone_0_1)
   deleted: (at-robot r2 zone_0_2)
   added: (at-robot r2 zone_0_1)
   goals met: 0 of 1
17. (move r2 zone_0_1 zone_0_0)
   deleted: (at-robot r2 zone_0_1)
   added: (at-robot r2 zone_0_0)
   goals met: 0 of 1
18. (drop r2 p2 zone_0_0)
   deleted: (in-robot p2 r2)
   added: (at-package p2 zone_0_0) (robot-free r2)
   goals met: 1 of 1
